In [1]:
import pandas as pd
import numpy as np


dates = pd.date_range("20250101", periods=6)
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2025-01-01 -0.674688 -0.081800 -0.245314 -0.414566
2025-01-02 -0.999509  0.349792 -0.520206 -0.220091
2025-01-03 -2.004563 -0.820158 -0.489592 -0.307504
2025-01-04  0.190015  0.088759 -0.790090  0.119618
2025-01-05  1.771018  1.949062 -0.109800  0.733256
2025-01-06  1.328018 -0.429116 -0.314822  0.910642

In [2]:
df1 = df.reindex(index=dates[0: 4], columns=list(df.columns) + ['E'])
df1.iloc[0:2,4] = 1
df1

                   A         B         C         D    E
2025-01-01 -0.674688 -0.081800 -0.245314 -0.414566  1.0
2025-01-02 -0.999509  0.349792 -0.520206 -0.220091  1.0
2025-01-03 -2.004563 -0.820158 -0.489592 -0.307504  NaN
2025-01-04  0.190015  0.088759 -0.790090  0.119618  NaN

In [3]:
df1.dropna()

                   A         B         C         D    E
2025-01-01 -0.674688 -0.081800 -0.245314 -0.414566  1.0
2025-01-02 -0.999509  0.349792 -0.520206 -0.220091  1.0

In [4]:
df1.fillna(5)

                   A         B         C         D    E
2025-01-01 -0.674688 -0.081800 -0.245314 -0.414566  1.0
2025-01-02 -0.999509  0.349792 -0.520206 -0.220091  1.0
2025-01-03 -2.004563 -0.820158 -0.489592 -0.307504  5.0
2025-01-04  0.190015  0.088759 -0.790090  0.119618  5.0

In [5]:
s = pd.Series([1, 3, 1, np.nan, 6, 8], index=dates).shift(2)
s

2025-01-01    NaN
2025-01-02    NaN
2025-01-03    1.0
2025-01-04    3.0
2025-01-05    1.0
2025-01-06    NaN
Freq: D, dtype: float64

In [6]:
df

                   A         B         C         D
2025-01-01 -0.674688 -0.081800 -0.245314 -0.414566
2025-01-02 -0.999509  0.349792 -0.520206 -0.220091
2025-01-03 -2.004563 -0.820158 -0.489592 -0.307504
2025-01-04  0.190015  0.088759 -0.790090  0.119618
2025-01-05  1.771018  1.949062 -0.109800  0.733256
2025-01-06  1.328018 -0.429116 -0.314822  0.910642

In [7]:
df.sub(s, axis="index")

                   A         B         C         D
2025-01-01       NaN       NaN       NaN       NaN
2025-01-02       NaN       NaN       NaN       NaN
2025-01-03 -3.004563 -1.820158 -1.489592 -1.307504
2025-01-04 -2.809985 -2.911241 -3.790090 -2.880382
2025-01-05  0.771018  0.949062 -1.109800 -0.266744
2025-01-06       NaN       NaN       NaN       NaN

In [8]:
df

                   A         B         C         D
2025-01-01 -0.674688 -0.081800 -0.245314 -0.414566
2025-01-02 -0.999509  0.349792 -0.520206 -0.220091
2025-01-03 -2.004563 -0.820158 -0.489592 -0.307504
2025-01-04  0.190015  0.088759 -0.790090  0.119618
2025-01-05  1.771018  1.949062 -0.109800  0.733256
2025-01-06  1.328018 -0.429116 -0.314822  0.910642

In [9]:
df.A.transform(lambda x: x*100)

2025-01-01    -67.468817
2025-01-02    -99.950928
2025-01-03   -200.456345
2025-01-04     19.001474
2025-01-05    177.101754
2025-01-06    132.801752
Freq: D, Name: A, dtype: float64

In [10]:
df.agg(lambda x: np.mean(x) * 100)

A    -6.495185
B    17.608991
C   -41.163726
D    13.689226
dtype: float64

In [11]:
pd.concat([df, df]).value_counts()

A          B          C          D
-2.004563  -0.820158  -0.489592  -0.307504    2
-0.999509   0.349792  -0.520206  -0.220091    2
-0.674688  -0.081800  -0.245314  -0.414566    2
 0.190015   0.088759  -0.790090   0.119618    2
 1.328018  -0.429116  -0.314822   0.910642    2
 1.771018   1.949062  -0.109800   0.733256    2
Name: count, dtype: int64

In [12]:
s = pd.Series(["A", "B", "C", "Aaba", "Baca", np.nan, "CABA", "dog", "cat"])
s

0       A
1       B
2       C
3    Aaba
4    Baca
5     NaN
6    CABA
7     dog
8     cat
dtype: object

In [13]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

In [14]:
df1 = df.copy(deep=True)
df1.columns = df.columns.str.lower()
df1

                   a         b         c         d
2025-01-01 -0.674688 -0.081800 -0.245314 -0.414566
2025-01-02 -0.999509  0.349792 -0.520206 -0.220091
2025-01-03 -2.004563 -0.820158 -0.489592 -0.307504
2025-01-04  0.190015  0.088759 -0.790090  0.119618
2025-01-05  1.771018  1.949062 -0.109800  0.733256
2025-01-06  1.328018 -0.429116 -0.314822  0.910642

In [15]:
df.join(df1)

,A,B,C,D,a,b,c,d
2025-01-01,-0.674688,-0.081800,-0.245314,-0.414566,-0.674688,-0.081800,-0.245314,-0.414566
2025-01-02,-0.999509,0.349792,-0.520206,-0.220091,-0.999509,0.349792,-0.520206,-0.220091
2025-01-03,-2.004563,-0.820158,-0.489592,-0.307504,-2.004563,-0.820158,-0.489592,-0.307504
2025-01-04,0.190015,0.088759,-0.790090,0.119618,0.190015,0.088759,-0.790090,0.119618
2025-01-05,1.771018,1.949062,-0.109800,0.733256,1.771018,1.949062,-0.109800,0.733256
2025-01-06,1.328018,-0.429116,-0.314822,0.910642,1.328018,-0.429116,-0.314822,0.910642

In [16]:
left = pd.DataFrame({"key": ["foo", "bar"], "lval": [1, 2]})
right = pd.DataFrame({"key": ["foo", "bar"], "rval": [4, 5]})

left.merge(right, on='key', how='inner')

   key  lval  rval
0  foo     1     4
1  bar     2     5

In [17]:
data = pd.DataFrame({"k1": ["one", "two"] * 3 + ["two"],"k2": [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [18]:
data[~data.k1.duplicated()]

    k1  k2
0  one   1
1  two   1

In [19]:
data.drop_duplicates('k1', keep='last')

    k1  k2
4  one   3
6  two   4

In [20]:
class Solution:
    def maxSubArray(self, nums: list[int]) -> int:
        res = float('-inf')
        curr = 0
        for n in nums:
            curr = max(0, curr+n)
            curr += n
            res = max(curr, res)
        
        return res

In [21]:
s = pd.Series(['a', 'b', 'c', 'd'] * 2)
cat_s = s.astype('category')
cat_s

0    a
1    b
2    c
3    d
4    a
5    b
6    c
7    d
dtype: category
Categories (4, object): ['a', 'b', 'c', 'd']

In [22]:
cat_s.cat.codes

0    0
1    1
2    2
3    3
4    0
5    1
6    2
7    3
dtype: int8

In [23]:
data = pd.Series(np.random.uniform(size=9), index=[["a", "a", "a", "b", "b", "c", "c", "d", "d"],  [1, 2, 3, 1, 3, 1, 2, 2, 3]])
data

a  1    0.540245
   2    0.651346
   3    0.612971
b  1    0.782506
   3    0.174093
c  1    0.143205
   2    0.074846
d  2    0.606100
   3    0.623161
dtype: float64

In [24]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [25]:
data.b

1    0.782506
3    0.174093
dtype: float64

In [26]:
data

a  1    0.540245
   2    0.651346
   3    0.612971
b  1    0.782506
   3    0.174093
c  1    0.143205
   2    0.074846
d  2    0.606100
   3    0.623161
dtype: float64

In [27]:
data.unstack()

          1         2         3
a  0.540245  0.651346  0.612971
b  0.782506       NaN  0.174093
c  0.143205  0.074846       NaN
d       NaN  0.606100  0.623161

In [28]:
df1 = pd.DataFrame({"key": ["b", "b", "a", "c", "a", "b"], "data1": pd.Series(range(6), dtype="Int64")})

df2 = pd.DataFrame({"key": ["a", "b", "a", "b", "d"], "data2": pd.Series(range(5), dtype="Int64")})

df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [29]:
df2

  key  data2
0   a      0
1   b      1
2   a      2
3   b      3
4   d      4

In [30]:
df1.merge(df2)

  key  data1  data2
0   b      0      1
1   b      0      3
2   b      1      1
3   b      1      3
4   a      2      0
5   a      2      2
6   a      4      0
7   a      4      2
8   b      5      1
9   b      5      3

In [31]:
pd.merge(df1, df2, how='inner')

  key  data1  data2
0   b      0      1
1   b      0      3
2   b      1      1
3   b      1      3
4   a      2      0
5   a      2      2
6   a      4      0
7   a      4      2
8   b      5      1
9   b      5      3

In [32]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [33]:
df2

  key  data2
0   a      0
1   b      1
2   a      2
3   b      3
4   d      4

In [34]:
df1.set_index('key').join(df2.set_index('key'))

     data1  data2
key
b        0      1
b        0      3
b        1      1
b        1      3
a        2      0
a        2      2
c        3   <NA>
a        4      0
a        4      2
b        5      1
b        5      3

In [ ]:
class Solution:
    def nextPermutation(self, nums) -> None:
        """
        Do not return anything, modify nums in-place instead.
        """
        n = len(nums)
        bp = n

        # 1. Find the first decreasing element from the right
        for idx in range(n-2, -1, -1):
            if nums[idx] < nums[idx+1]:
                bp = idx
                break


        # 2. Find the next biggest number from the right and swap it
        for idx in range(n-1, bp, -1):
            if nums[idx] > nums[bp]:
                nums[bp], nums[idx] = nums[idx], nums[bp]
                break

        # 3. Reverse the remaining array (bp+1 to end)
        if bp == n:
            nums.reverse()
        else:
            nums[bp+1:] = reversed(nums[bp+1:])